/* 
Задача какая, какие функции должны быть в погоде?
1. Запрос данных с другого сервера и показ на странице по указанному городу. 
  Асинхронный запрос
  
2. Функциональный слайдер, возможнолсть переключаться между города. {
  2.1 Слайдер, основная по середине, остальные на половину скрыты и размыты. 
  2.2 При нажатие на кнопку, переключать на другой слайд, то есть на другой контейнер с погодой. {
    Идея такая может быть, при переключении можно менять картинку, или же воспользоваться перемещением слайда.   
    Можно воспользоваться со смещением картинки тиоп плюс сколько то пикселей и так будет смещаться. Решим. Сегодня ДР, так что потом все ! 
  }
  2.3 При достижение конца слайда, переходить на начало и так до бесконечности.
  2.4     
}

*/